
let one =  document.getElementById('n')



function ibadat () 
{
    const ibad = document.getElementById('timer').value
    
    let slat = ['نفل','الفاتحہ','البقرہ',' آل عمران','النساء','المائدہ','الأنعام','الأعراف','الأنفال',
    'التوبہ','یونس','ہود','یوسف','مریم','الرعد','ابراہیم','الحجر','النحل',
    'الإسراء','الکہف','طہ','الانبیاء','الحج','المؤمنون','النور','الفرقان',
    'الشعراء','النمل','القصص','العنکبوت','الروم','لقمان','السجدہ','الأحزاب',
    'سبا','فاطر','یٰس','الصافات','ص','الزمر','غافر','فصلت','الشوریٰ','الزخرف',
    'الدخان','الجاثیہ','الاحقاف','محمد','الفتح','الحجرات','ق','الذاریات',
    'الطور','النجم','القمر','الرحمن','الواقعہ','الحدید','المجادلہ','الحشر',
    'الممتحنہ','الصف','الجمعہ','المنافقون','التغابن','الطلاق','التحریم','الملک',
    'القلم','الحاقہ','المعارج','نوح','الجن','المزمل','المدثر','القیامہ',
    'الانسان','المرسلات','النبا','النازعات','عبس','التکویر','الانفطار','المطففین',
    'الانشقاق','البروج','الطارق','الأعلى','الغاشیہ','الفجر','البلد',
    'الشمس','اللیل','الضحیٰ','الشرح','التین','العلق','القدر','البینہ','الزلزلہ',
    'العادیات','القارعہ','التکاثر','العصر','الہمزہ','الفیل','قریش','الماعون',
    'الکوثر','الکافرون','النصر','المسد','الإخلاص','الفلق','الناس'];
   for ( let index=1; index <= ibad; index++)
   
    one .innerHTML=  " سورت " +" "+ "("+(slat [ibad])+")" +" " +"قرآن کریم کی " +"سورت نمبر"+ index +" ہے"

   
    
    
    

    


    
}

let one1 =  document.getElementById('c') 

function mahena(){

 {
   one1.innerHTML='';
    const  mon = document.getElementById('month').value
   
    let my =['mon','January','February','March','April','May','June','July','July','August','September','October','November','December']
   
    

       for (let index = 0; index <=mon; index++) 
      one1.  innerHTML = my[mon];}
            
   
  
}